app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `customer`
SELECT COUNT(*) AS `numrows`
FROM `product`
SELECT COUNT(*) AS `numrows`
FROM `order`
---
    public function index()
    {
        // return view('admin/dashbord', ['title' => 'Dashbord']);


        $customerModel = new CustomerModel();
        $eventModel = new ProductModel();
        $bookingModel = new OrderModel();

        $totalCustomers = $customerModel->countAllResults();
        $totalEvents = $eventModel->countAllResults();
        $totalBookings = $bookingModel->countAllResults();