app/Controllers/Customer.php

SELECT *
FROM `customer`
---
    public function getCustomers()
    {
        $model = new CustomerModel();

        $customers = $model->findAll();