app/Controllers/OrderController.php

SELECT *
FROM `customer`
SELECT *
FROM `product`
---
    public function index()
    {
        $productModel = new ProductModel();
        $customerModel = new CustomerModel();

        // Load all customers and products
        $data['customers'] = $customerModel->findAll();
        $data['products'] = $productModel->findAll();

INSERT INTO `order` (`customer_id`, `product_id`, `quantity`, `order_date`, `total`, `order_status`) VALUES ('13', '5', '1', '2024-12-17 12:21:00', 2000, 'Pending')
---
    public function addOrder()
    {
        $orderModel = new OrderModel();


        $data = $this->request->getJSON();


        $orderData = [
            'customer_id' => $data->customer_id,
            'product_id' => $data->product_id,
            'quantity' => $data->quantity,
            'order_date' => date('Y-m-d H:i:s'),
            'total' => $data->total,
            'order_status' => 'Pending'
        ];

        $orderModel->insert($orderData);

SELECT `order`.`id`, `customer`.`name` as `customer_name`, `product`.`name` as `product_name`, `order`.`quantity`, `product`.`price`, `customer`.`pincode`, `customer`.`address`, `order`.`order_date`, `order`.`order_status`
FROM `order`
JOIN `customer` ON `order`.`customer_id` = `customer`.`id`
JOIN `product` ON `order`.`product_id` = `product`.`id`
---
    public function getOrders()
    {
        $orderModel = new OrderModel();
        $customerModel = new CustomerModel();
        $productModel = new ProductModel();


        $orders = $orderModel->select('order.id, customer.name as customer_name, product.name as product_name, order.quantity, product.price, customer.pincode, customer.address, order.order_date, order.order_status')
            ->join('customer', 'order.customer_id = customer.id')
            ->join('product', 'order.product_id = product.id')
            ->findAll();